{
  "genres": [
    {
      "id": 1,
      "name": "Action"
    },
    {
      "id": 2,
      "name": "Adventure"
    },
    {
      "id": 3,
      "name": "Role-Playing"
    },
    {
      "id": 4,
      "name": "Horror"
    },
    {
      "id": 5,
      "name": "Sports"
    },
    {
      "id": 6,
      "name": "Simulation"
    },
    {
      "id": 7,
      "name": "Racing"
    },
    {
      "id": 8,
      "name": "FPS"
    },
    {
      "id": 9,
      "name": "Platformer"
    },
    {
      "id": 10,
      "name": "Fighting"
    }
  ],
  "games": [
    {
      "id": 1,
      "title": "A Plague Tale: Innocence",
      "platform": [
        "PC",
        "PlayStation 4",
        "Xbox One"
      ],
      "releaseDate": "2019-05-14",
      "genreId": 4
    },
    {
      "id": 2,
      "title": "Hades",
      "platform": [
        "PC",
        "Nintendo Switch"
      ],
      "releaseDate": "2020-09-17",
      "genreId": 3
    },
    {
      "id": 3,
      "title": "Celeste",
      "platform": [
        "PC",
        "PlayStation 4",
        "Xbox One",
        "Nintendo Switch"
      ],
      "releaseDate": "2018-01-25",
      "genreId": 9
    },
    {
      "id": 4,
      "title": "Stardew Valley",
      "platform": [
        "PC",
        "PlayStation 4",
        "Xbox One",
        "Nintendo Switch"
      ],
      "releaseDate": "2016-02-26",
      "genreId": 6
    },
    {
      "id": 5,
      "title": "Undertale",
      "platform": [
        "PC",
        "PlayStation 4",
        "PlayStation Vita",
        "Nintendo Switch"
      ],
      "releaseDate": "2015-09-15",
      "genreId": 9
    },
    {
      "id": 6,
      "title": "Disco Elysium",
      "platform": [
        "PC",
        "PlayStation 4",
        "PlayStation 5",
        "Xbox Series X/S"
      ],
      "releaseDate": "2019-10-15",
      "genreId": 3
    },
    {
      "id": 7,
      "title": "Katana ZERO",
      "platform": [
        "PC",
        "Nintendo Switch"
      ],
      "releaseDate": "2019-04-18",
      "genreId": 2
    },
    {
      "id": 8,
      "title": "Firewatch",
      "platform": [
        "PC",
        "PlayStation 4",
        "Xbox One",
        "Nintendo Switch"
      ],
      "releaseDate": "2016-02-09",
      "genreId": 2
    },
    {
      "id": 9,
      "title": "Outer Wilds",
      "platform": [
        "PC",
        "PlayStation 4",
        "Xbox One"
      ],
      "releaseDate": "2019-05-29",
      "genreId": 2
    },
    {
      "id": 10,
      "title": "Hyper Light Drifter",
      "platform": [
        "PC",
        "PlayStation 4",
        "Xbox One",
        "Nintendo Switch"
      ],
      "releaseDate": "2016-03-31",
      "genreId": 5
    },
    {
      "id": 11,
      "title": "Assassin's Creed Valhalla",
      "platform": [
        "PC",
        "PlayStation 4",
        "PlayStation 5",
        "Xbox One",
        "Xbox Series X/S"
      ],
      "releaseDate": "2020-11-10",
      "genreId": 2
    },
    {
      "id": 12,
      "title": "Call of Duty: Warzone",
      "platform": [
        "PC",
        "PlayStation 4",
        "PlayStation 5",
        "Xbox One",
        "Xbox Series X/S"
      ],
      "releaseDate": "2020-03-10",
      "genreId": 1
    },
    {
      "id": 13,
      "title": "Cyberpunk 2077",
      "platform": [
        "PC",
        "PlayStation 4",
        "PlayStation 5",
        "Xbox One",
        "Xbox Series X/S"
      ],
      "releaseDate": "2020-12-10",
      "genreId": 1
    },
    {
      "id": 14,
      "title": "FIFA 22",
      "platform": [
        "PC",
        "PlayStation 4",
        "PlayStation 5",
        "Xbox One",
        "Xbox Series X/S",
        "Nintendo Switch"
      ],
      "releaseDate": "2021-10-01",
      "genreId": 5
    },
    {
      "id": 15,
      "title": "The Elder Scrolls V: Skyrim",
      "platform": [
        "PC",
        "PlayStation 4",
        "Xbox One",
        "Nintendo Switch"
      ],
      "releaseDate": "2011-11-11",
      "genreId": 3
    },
    {
      "id": 16,
      "title": "Fallout 4",
      "platform": [
        "PC",
        "PlayStation 4",
        "Xbox One"
      ],
      "releaseDate": "2015-11-10",
      "genreId": 3
    },
    {
      "id": 17,
      "title": "Super Smash Bros. Ultimate",
      "platform": "Nintendo Switch",
      "releaseDate": "2018-12-07",
      "genreId": 10
    },
    {
      "id": 18,
      "title": "League of Legends",
      "platform": "PC",
      "releaseDate": "2009-10-27",
      "genreId": 7
    },
    {
      "id": 19,
      "title": "Apex Legends",
      "platform": [
        "PC",
        "PlayStation 4",
        "PlayStation 5",
        "Xbox One",
        "Xbox Series X/S"
      ],
      "releaseDate": "2019-02-04",
      "genreId": 8
    },
    {
      "id": 20,
      "title": "Mortal Kombat 11",
      "platform": [
        "PC",
        "PlayStation 4",
        "PlayStation 5",
        "Xbox One",
        "Xbox Series X/S",
        "Nintendo Switch"
      ],
      "releaseDate": "2019-04-23",
      "genreId": 10
    },
    {
      "id": 21,
      "title": "Resident Evil Village",
      "platform": [
        "PC",
        "PlayStation 4",
        "PlayStation 5",
        "Xbox One",
        "Xbox Series X/S"
      ],
      "releaseDate": "2021-05-07",
      "genreId": 4
    },
    {
      "id": 22,
      "title": "Hades",
      "platform": [
        "PC",
        "Nintendo Switch",
        "PlayStation 4",
        "PlayStation 5",
        "Xbox One",
        "Xbox Series X/S"
      ],
      "releaseDate": "2020-09-17",
      "genreId": 9
    },
    {
      "id": 23,
      "title": "Marvel's Spider-Man: Miles Morales",
      "platform": [
        "PlayStation 4",
        "PlayStation 5"
      ],
      "releaseDate": "2020-11-12",
      "genreId": 2
    },
    {
      "id": 24,
      "title": "Ghost of Tsushima",
      "platform": "PlayStation 4",
      "releaseDate": "2020-07-17",
      "genreId": 3
    },
    {
      "id": 25,
      "title": "Animal Crossing: New Horizons",
      "platform": "Nintendo Switch",
      "releaseDate": "2020-03-20",
      "genreId": 6
    },
    {
      "id": 26,
      "title": "World of Warcraft",
      "platform": "PC",
      "releaseDate": "2004-11-23",
      "genreId": 7
    },
    {
      "id": 28,
      "title": "Doom Eternal",
      "platform": [
        "PC",
        "PlayStation 4",
        "Xbox One",
        "Nintendo Switch"
      ],
      "releaseDate": "2020-03-20",
      "genreId": 8
    },
    {
      "id": 29,
      "title": "Star Wars Jedi: Fallen Order",
      "platform": [
        "PC",
        "PlayStation 4",
        "PlayStation 5",
        "Xbox One",
        "Xbox Series X/S"
      ],
      "releaseDate": "2019-11-15",
      "genreId": 1
    },
    {
      "id": 30,
      "title": "Horizon Zero Dawn",
      "platform": [
        "PC",
        "PlayStation 4"
      ],
      "releaseDate": "2017-02-28",
      "genreId": 3
    }
  ],
  "reviews": [
    {
      "gameId": 1,
      "score": 92,
      "title": "A Masterpiece RPG",
      "body": "The Witcher 3: Wild Hunt is an incredible RPG that offers a rich and immersive open world, captivating storylines, and memorable characters. The gameplay mechanics are polished, the graphics are stunning, and the soundtrack is exceptional. It's a must-play for any fan of the genre.",
      "author": "RPGEnthusiast",
      "ageRating": "Mature",
      "date": "2022-11-15"
    },
    {
      "gameId": 2,
      "score": 91,
      "title": "A Breath of Fresh Air",
      "body": "The Legend of Zelda: Breath of the Wild redefines what an open-world adventure game can be. With its vast and beautifully crafted world, innovative gameplay mechanics, and engaging puzzles, it offers an unforgettable experience. The attention to detail and the sense of exploration make it a true masterpiece.",
      "author": "AdventureSeeker",
      "ageRating": "Everyone 10+",
      "date": "2022-11-15"
    },
    {
      "gameId": 3,
      "score": 97,
      "title": "A Western Epic",
      "body": "Red Dead Redemption 2 is a stunning achievement in storytelling and world-building. The immersive and realistic world, coupled with memorable characters and a gripping narrative, make it one of the best games of this generation. The attention to detail, from the breathtaking visuals to the intricate gameplay mechanics, is truly remarkable.",
      "author": "WildWestFan",
      "ageRating": "Mature",
      "date": "2022-11-15"
    },
    {
      "gameId": 4,
      "score": 87,
      "title": "A Crime-Filled Adventure",
      "body": "Grand Theft Auto V offers a sprawling open world filled with opportunities for chaos and mayhem. The three protagonists provide an interesting twist to the gameplay, and the missions are varied and engaging. The online multiplayer component adds even more depth to the experience, making it a must-play for fans of the series.",
      "author": "CrimeLord",
      "ageRating": "Mature",
      "date": "2022-11-15"
    },
    {
      "gameId": 5,
      "score": 93,
      "title": "A Block-Building Phenomenon",
      "body": "Minecraft is a game that sparks creativity and allows players to build their own virtual worlds. With its endless possibilities and addictive gameplay, it has captured the hearts of millions of players worldwide. Whether you enjoy mining, crafting, or exploring, Minecraft offers something for everyone.",
      "author": "CraftingEnthusiast",
      "ageRating": "Everyone",
      "date": "2022-11-15"
    },
    {
      "gameId": 6,
      "score": 95,
      "title": "An Epic Norse Adventure",
      "body": "God of War is a stunning and emotional journey that follows Kratos and his son Atreus as they navigate the treacherous realms of Norse mythology. The combat is satisfying and brutal, the storytelling is captivating, and the world is beautifully realized. It's a game that raises the bar for action-adventure titles.",
      "author": "MythologyFan",
      "ageRating": "Mature",
      "date": "2022-11-15"
    },
    {
      "gameId": 7,
      "score": 90,
      "title": "A Joyful Mario Adventure",
      "body": "Super Mario Odyssey is a delightful and whimsical platformer that showcases Nintendo's creativity and charm. The imaginative levels, clever gameplay mechanics, and catchy music make it a joy to play. It's a must-have for any Nintendo Switch owner and a worthy addition to the Mario franchise.",
      "author": "PlatformerFanatic",
      "ageRating": "Everyone",
      "date": "2022-06-01"
    },
    {
      "gameId": 8,
      "score": 85,
      "title": "A Battle Royale Sensation",
      "body": "Fortnite took the gaming world by storm with its addictive and fast-paced battle royale gameplay. The constant updates and additions keep the game fresh, and the cross-platform support allows players to compete with friends on different devices. While it may not be everyone's cup of tea, it's hard to deny its impact on the industry.",
      "author": "BattleRoyalePro",
      "ageRating": "Teen",
      "date": "2023-04-01"
    },
    {
      "gameId": 9,
      "score": 89,
      "title": "A Team-Based Shooter",
      "body": "Overwatch combines fast-paced action with strategic team-based gameplay, making it a refreshing addition to the shooter genre. The diverse roster of heroes and the emphasis on teamwork create exciting and dynamic matches. While it may not have the same longevity as some other online shooters, it's still a highly enjoyable experience.",
      "author": "TeamPlayer",
      "ageRating": "Teen",
      "date": "2023-05-17"
    },
    {
      "gameId": 10,
      "score": 94,
      "title": "A Gripping Post-Apocalyptic Tale",
      "body": "The Last of Us Part II continues the gripping story of Ellie and Joel in a beautifully crafted and emotionally charged world. The gameplay seamlessly blends intense combat with exploration and puzzle-solving. It's a game that challenges players morally and leaves a lasting impact.",
      "author": "SurvivalistGamer",
      "ageRating": "Mature",
      "date": "2022-07-03"
    },
    {
      "gameId": 11,
      "score": 88,
      "title": "A Captivating Sci-Fi Adventure",
      "body": "In Mass Effect Legendary Edition, players embark on a thrilling journey through the galaxy as Commander Shepard. The remastered trilogy offers improved visuals, updated gameplay mechanics, and all the DLC content included. The rich and immersive sci-fi universe, along with impactful decision-making, delivers a truly unforgettable experience. Whether you're exploring uncharted planets, engaging in intense battles, or forming deep connections with your crew, Mass Effect Legendary Edition is a must-play for any fan of the series or sci-fi genre.",
      "author": "GalacticExplorer",
      "ageRating": "Mature",
      "date": "2023-02-09"
    },
    {
      "gameId": 12,
      "score": 85,
      "title": "A Thrilling Battle Royale Experience",
      "body": "Call of Duty: Warzone takes the popular franchise to new heights with its free-to-play battle royale mode. Engage in intense firefights, tactical strategies, and fast-paced action as you fight for survival in a massive open-world map. With its realistic graphics, fluid gunplay, and regular updates, Warzone keeps players hooked with its addictive gameplay. Whether you prefer solo play or teaming up with friends, Call of Duty: Warzone offers an exhilarating and adrenaline-pumping experience for fans of the genre.",
      "author": "WarzoneGamer",
      "ageRating": "Mature",
      "date": "2023-01-14"
    },
    {
      "gameId": 13,
      "score": 80,
      "title": "A Futuristic Open-World RPG",
      "body": "Step into Night City with Cyberpunk 2077, an immersive open-world RPG set in a dystopian future. Explore a sprawling metropolis, engage in high-stakes missions, and make impactful choices that shape the story. Despite its technical issues at launch, the game offers a captivating narrative, stunning visuals, and a deep character customization system. Dive into a world of cybernetic enhancements, corporate conspiracies, and morally ambiguous decisions in Cyberpunk 2077.",
      "author": "Netrunner",
      "ageRating": "Mature",
      "date": "2023-03-21"
    },
    {
      "gameId": 14,
      "score": 90,
      "title": "The Ultimate Soccer Experience",
      "body": "FIFA 22 delivers the most realistic and immersive soccer experience yet. With improved graphics, fluid gameplay, and enhanced player animations, it truly captures the essence of the sport. Whether you're playing a thrilling match in career mode, competing against friends in online multiplayer, or building your ultimate team, FIFA 22 offers hours of excitement. The attention to detail in recreating the stadiums, player movements, and tactical strategies is remarkable. For fans of the beautiful game, FIFA 22 is a must-have title.",
      "author": "SoccerFanatic",
      "ageRating": "Everyone",
      "date": "2022-10-13"
    },
    {
      "gameId": 15,
      "score": 95,
      "title": "A Legendary Fantasy Adventure",
      "body": "The Elder Scrolls V: Skyrim is an epic open-world RPG that immerses players in a rich and captivating fantasy universe. From the moment you step foot in the breathtaking land of Skyrim, you're greeted with a vast world full of ancient ruins, majestic mountains, and dangerous creatures. With its deep lore, immersive quests, and freedom to explore, Skyrim offers an unparalleled sense of adventure. Whether you choose to follow the main storyline, join guilds, or simply wander the wilderness, there's always something new to discover. Prepare to lose yourself in the enchanting world of Skyrim.",
      "author": "Dragonborn",
      "ageRating": "Mature",
      "date": "2022-12-02"
    },
    {
      "gameId": 16,
      "score": 88,
      "title": "A Post-Apocalyptic Adventure",
      "body": "Fallout 4 is a gripping post-apocalyptic RPG set in the ruins of Boston. Step into the shoes of the Sole Survivor as you navigate a world ravaged by nuclear war, encountering mutants, factions, and the harsh realities of survival. With its expansive open world, immersive storytelling, and dynamic gameplay, Fallout 4 offers endless possibilities. Whether you're building settlements, customizing weapons, or making impactful choices, your actions shape the fate of the wasteland. Prepare for an unforgettable journey in the Fallout universe.",
      "author": "WastelandExplorer",
      "ageRating": "Mature",
      "date": "2022-08-27"
    },
    {
      "gameId": 17,
      "score": 96,
      "title": "The Ultimate Crossover Fighting Game",
      "body": "Super Smash Bros. Ultimate brings together an all-star cast of iconic characters from various gaming franchises in an epic crossover fighting game. With its fast-paced gameplay, diverse roster of fighters, and a wide range of stages, it offers endless excitement for both casual and competitive players. Whether you're battling it out with friends locally or engaging in intense online matches, Super Smash Bros. Ultimate delivers a thrilling multiplayer experience. The attention to detail in the character animations, stage designs, and nostalgic references make it a love letter to gaming history. Get ready to settle it in Smash!",
      "author": "SmashMaster",
      "ageRating": "Everyone",
      "date": "2023-06-10"
    },
    {
      "gameId": 18,
      "score": 92,
      "title": "The Pinnacle of Competitive MOBA",
      "body": "League of Legends is a highly competitive multiplayer online battle arena (MOBA) game that has captivated millions of players worldwide. With its strategic depth, fast-paced gameplay, and constantly evolving meta, it offers an intense and rewarding experience. Choose from a diverse roster of champions, each with their own unique abilities and playstyles, and work together with your team to outmaneuver and outsmart your opponents. Whether you're participating in ranked matches, engaging in epic team fights, or mastering complex strategies, League of Legends is the ultimate test of skill and teamwork.",
      "author": "Summoner",
      "ageRating": "Teen",
      "date": "2022-07-27"
    },
    {
      "gameId": 19,
      "score": 94,
      "title": "The Ultimate Battle Royale Experience",
      "body": "Apex Legends is a thrilling free-to-play battle royale game that takes the genre to new heights. Jump into the arena as a Legend, each with their own unique abilities, and fight against other squads in fast-paced matches. The fluid movement mechanics, strategic gameplay, and constant updates make it a must-play for battle royale enthusiasts. Whether you're coordinating with your team, looting for powerful weapons, or using your abilities to outmaneuver your opponents, Apex Legends delivers exhilarating moments and intense gunfights that keep you coming back for more.",
      "author": "ApexChampion",
      "ageRating": "Teen",
      "date": "2023-03-14"
    },
    {
      "gameId": 20,
      "score": 88,
      "title": "Brutal Combat and Stunning Visuals",
      "body": "Mortal Kombat 11 is a fighting game that raises the bar for the iconic franchise. Engage in visceral battles as legendary characters, executing bone-crushing moves and jaw-dropping fatalities. With its smooth gameplay, extensive character customization, and captivating story mode, Mortal Kombat 11 offers a complete fighting game experience. The detailed graphics, brutal animations, and diverse roster of fighters make each match an adrenaline-pumping spectacle. Whether you're competing against friends locally or challenging opponents online, Mortal Kombat 11 delivers a satisfying mix of nostalgia and innovation.",
      "author": "Kombatant",
      "ageRating": "Mature",
      "date": "2023-02-21"
    },
    {
      "gameId": 21,
      "score": 90,
      "title": "A Terrifying Survival Horror Experience",
      "body": "Resident Evil Village continues the iconic survival horror franchise with a chilling and intense journey. Step into the shoes of Ethan Winters as he explores a mysterious village filled with grotesque creatures and a haunting atmosphere. With its atmospheric graphics, immersive gameplay, and spine-tingling encounters, Resident Evil Village delivers a memorable horror experience. Solve puzzles, scavenge for resources, and fight for survival in a world filled with unimaginable horrors. Brace yourself for a nerve-wracking adventure that will keep you on the edge of your seat.",
      "author": "HorrorFanatic",
      "ageRating": "Mature",
      "date": "2023-02-24"
    },
    {
      "gameId": 22,
      "score": 96,
      "title": "An Immersive Rogue-like Action Game",
      "body": "Hades is a captivating rogue-like action game that combines fast-paced combat, a rich narrative, and stunning visuals. Descend into the depths of the underworld as Zagreus, the son of Hades, and battle your way through hordes of mythical creatures. With its addictive gameplay loop, intricate character relationships, and dynamic storytelling, Hades offers an engaging and rewarding experience. Unleash powerful abilities, upgrade your weapons, and unravel the mysteries of the underworld in this masterpiece from Supergiant Games.",
      "author": "RogueSlayer",
      "ageRating": "Teen",
      "date": "2023-03-15"
    },
    {
      "gameId": 23,
      "score": 92,
      "title": "A Spectacular Superhero Adventure",
      "body": "Marvel's Spider-Man: Miles Morales takes players on a thrilling web-slinging adventure in the bustling city of New York. Assume the role of Miles Morales as he embraces his new powers and battles against a rising threat. With its stunning visuals, seamless traversal, and exciting combat mechanics, the game captures the essence of being a superhero. Explore a vibrant open-world, uncover hidden secrets, and experience an emotional and inspiring story. Swing through the city streets and unleash your spider-powers in this remarkable continuation of the Spider-Man franchise.",
      "author": "SpideyFan",
      "ageRating": "Teen",
      "date": "2022-08-23"
    },
    {
      "gameId": 24,
      "score": 95,
      "title": "An Epic Samurai Adventure",
      "body": "Ghost of Tsushima transports players to feudal Japan during the Mongol invasion, offering an immersive samurai experience like no other. Embark on a quest for vengeance as Jin Sakai, a skilled warrior determined to protect his homeland. With its breathtaking landscapes, captivating storytelling, and thrilling sword-fighting mechanics, Ghost of Tsushima captivates players from start to finish. Engage in epic duels, stealthily assassinate enemies, and make choices that shape the fate of Tsushima. Prepare to embark on an unforgettable journey of honor, sacrifice, and redemption.",
      "author": "SamuraiSoul",
      "ageRating": "Mature",
      "date": "2023-04-16"
    },
    {
      "gameId": 25,
      "score": 95,
      "title": "A Charming and Relaxing Life Simulator",
      "body": "Animal Crossing: New Horizons offers a delightful and immersive life simulation experience that captures the hearts of players worldwide. Step onto your very own deserted island and create your dream getaway. With its charming characters, beautiful visuals, and calming gameplay, it provides a peaceful escape from reality. Decorate your home, design the island to your liking, and build relationships with adorable animal villagers. Whether you're fishing, bug catching, or participating in seasonal events, Animal Crossing: New Horizons offers a cozy and heartwarming virtual paradise.",
      "author": "IslandExplorer",
      "ageRating": "Everyone",
      "date": "2022-07-15"
    },
    {
      "gameId": 26,
      "score": 90,
      "title": "A Legendary MMORPG Adventure",
      "body": "World of Warcraft is an iconic massively multiplayer online role-playing game (MMORPG) that has shaped the genre for over a decade. Embark on epic quests, join forces with friends, and explore a vast fantasy world filled with wonders and dangers. With its immersive lore, deep gameplay systems, and a passionate community, World of Warcraft offers an endless adventure. Engage in thrilling PvP battles, conquer challenging raids, or simply immerse yourself in the rich storylines and expansive world. Prepare to lose yourself in the vast and ever-evolving universe of Azeroth.",
      "author": "HeroicAdventurer",
      "ageRating": "Teen",
      "date": "2022-08-13"
    },
    {
      "gameId": 27,
      "score": 88,
      "title": "Unleash Your Creativity in a Virtual World",
      "body": "The Sims 4 is a beloved life simulation game that allows you to create and control virtual people in a variety of exciting scenarios. Build your dream homes, shape the lives of your Sims, and experience their triumphs and challenges. With its intuitive building tools, diverse customization options, and engaging gameplay mechanics, The Sims 4 offers endless possibilities. Whether you're pursuing career aspirations, forming relationships, or exploring the vibrant neighborhoods, The Sims 4 lets you unleash your creativity and tell captivating stories in a virtual world.",
      "author": "SimmerExtraordinaire",
      "ageRating": "Teen",
      "date": "2023-05-01"
    },
    {
      "gameId": 28,
      "score": 92,
      "title": "A High-Octane Demon-Slaying Adventure",
      "body": "Doom Eternal is an adrenaline-fueled first-person shooter that puts you in the shoes of the legendary Doom Slayer. Battle against hordes of demons from Hell across various dimensions and save humanity from the brink of destruction. With its fast-paced gameplay, intense gunfights, and brutal glory kills, Doom Eternal delivers an exhilarating and satisfying experience. Unleash an arsenal of powerful weapons, master your mobility, and face off against epic bosses in the ultimate fight for survival. Prepare for an action-packed and pulse-pounding demon-slaying adventure.",
      "author": "SlayerOfDemons",
      "ageRating": "Mature",
      "date": "2022-07-19"
    },
    {
      "gameId": 29,
      "score": 94,
      "title": "An Epic Jedi Journey in the Star Wars Universe",
      "body": "Star Wars Jedi: Fallen Order offers a thrilling and immersive action-adventure experience set in the beloved Star Wars universe. Assume the role of Cal Kestis, a young Jedi Padawan, as he embarks on a quest to rebuild the Jedi Order in the aftermath of Order 66. With its engaging story, challenging combat, and stunning visuals, Star Wars Jedi: Fallen Order captures the essence of a true Jedi journey. Use your lightsaber skills, harness the Force, and explore beautifully crafted worlds in this epic Star Wars saga.",
      "author": "ForceWielder",
      "ageRating": "Teen",
      "date": "2023-06-05"
    },
    {
      "gameId": 30,
      "score": 96,
      "title": "A Captivating Open-World Adventure",
      "body": "Horizon Zero Dawn takes players on a breathtaking journey in a post-apocalyptic world dominated by mechanized creatures. Assume the role of Aloy, a skilled hunter, and uncover the mysteries of her past and the origins of the robotic beasts. With its stunning visuals, immersive gameplay, and compelling narrative, Horizon Zero Dawn offers an unforgettable open-world experience. Engage in thrilling battles, explore a vast and diverse landscape, and unravel the secrets of this captivating and dangerous world. Prepare to embark on an epic quest of discovery and survival.",
      "author": "NatureSeeker",
      "ageRating": "Teen",
      "date": "2022-11-13"
    }
  ],
  "userReviews": [
    {
      "id": 1,
      "gameId": 1,
      "score": 8,
      "title": "Great Game!",
      "body": "I had a lot of fun playing this game. The graphics are impressive and the gameplay is engaging.",
      "author": "GamingEnthusiast24",
      "date": "2023-03-13",
      "userId": 3
    },
    {
      "id": 2,
      "gameId": 1,
      "score": 6,
      "title": "Decent Game",
      "body": "It's an okay game. The visuals are nice, but I felt the gameplay could have been better.",
      "author": "CasualGamer99",
      "date": "2022-06-23",
      "userId": 7
    },
    {
      "id": 3,
      "gameId": 2,
      "score": 9,
      "title": "Highly Addictive!",
      "body": "I couldn't put this game down! It's incredibly addictive and the multiplayer is a blast.",
      "author": "GamingAddict365",
      "date": "2022-12-03",
      "userId": 5
    },
    {
      "id": 4,
      "gameId": 2,
      "score": 7,
      "title": "Fun but Flawed",
      "body": "This game has its moments of fun, but there are some flaws that can be frustrating at times.",
      "author": "CompetitiveGamer22",
      "date": "2022-07-11",
      "userId": 2
    },
    {
      "id": 5,
      "gameId": 3,
      "score": 8,
      "title": "Immersive Experience",
      "body": "Playing this game feels like diving into a whole new world. The story and characters are captivating.",
      "author": "StorytellerPlayer",
      "date": "2022-11-23",
      "userId": 8
    },
    {
      "id": 6,
      "gameId": 3,
      "score": 6,
      "title": "Not for Everyone",
      "body": "This game has a unique style, but it may not appeal to everyone's taste. Give it a try if you're curious.",
      "author": "OpenMindedGamer",
      "date": "2022-07-30",
      "userId": 6
    },
    {
      "id": 7,
      "gameId": 4,
      "score": 9,
      "title": "Masterpiece!",
      "body": "I consider this game a masterpiece. The graphics, gameplay, and story are all top-notch.",
      "author": "GamingConnoisseur",
      "date": "2023-03-29",
      "userId": 1
    },
    {
      "id": 8,
      "gameId": 4,
      "score": 7,
      "title": "Solid Game",
      "body": "It's a solid game with good mechanics, but it didn't blow me away like I expected.",
      "author": "CasualPlayer123",
      "date": "2023-04-04",
      "userId": 10
    },
    {
      "id": 9,
      "gameId": 5,
      "score": 8,
      "title": "Fun and Exciting!",
      "body": "This game is a lot of fun and keeps you on the edge of your seat. Highly recommended.",
      "author": "AdrenalineJunkie",
      "date": "2023-03-06",
      "userId": 3
    },
    {
      "id": 10,
      "gameId": 5,
      "score": 6,
      "title": "Average Game",
      "body": "It's an average game that offers some enjoyment, but it lacks that special something.",
      "author": "EverydayGamer",
      "date": "2023-03-18",
      "userId": 4
    },
    {
      "id": 11,
      "gameId": 6,
      "score": 8,
      "title": "Addictive Gameplay!",
      "body": "I couldn't stop playing this game! The gameplay is addictive, and the graphics are stunning.",
      "author": "GameMaster88",
      "date": "2023-06-02",
      "userId": 5
    },
    {
      "id": 12,
      "gameId": 6,
      "score": 7,
      "title": "Solid RPG",
      "body": "This game offers a solid RPG experience with interesting quests and character progression.",
      "author": "QuestHunter42",
      "date": "2022-12-06",
      "userId": 9
    },
    {
      "id": 13,
      "gameId": 6,
      "score": 9,
      "title": "Immersive World",
      "body": "The world of this game is incredibly immersive, and the story keeps you hooked from start to finish.",
      "author": "FantasyExplorer",
      "date": "2023-05-21",
      "userId": 2
    },
    {
      "id": 14,
      "gameId": 6,
      "score": 6,
      "title": "Mixed Feelings",
      "body": "I have mixed feelings about this game. While it has some great aspects, it also has its fair share of flaws.",
      "author": "GamerOpinions",
      "date": "2023-03-01",
      "userId": 7
    },
    {
      "id": 15,
      "gameId": 7,
      "score": 9,
      "title": "Gorgeous Visuals!",
      "body": "This game boasts stunning visuals that truly bring the game world to life. It's a treat for the eyes.",
      "author": "VisualEnthusiast",
      "date": "2023-03-30",
      "userId": 6
    },
    {
      "id": 16,
      "gameId": 7,
      "score": 8,
      "title": "Intense Action",
      "body": "Get ready for intense action in this game! The combat mechanics are fluid and satisfying.",
      "author": "ActionGamer21",
      "date": "2022-12-27",
      "userId": 8
    },
    {
      "id": 17,
      "gameId": 7,
      "score": 7,
      "title": "Decent Adventure",
      "body": "If you're looking for a decent adventure game with some interesting puzzles, give this game a try.",
      "author": "AdventureSeeker",
      "date": "2023-05-04",
      "userId": 4
    },
    {
      "id": 18,
      "gameId": 7,
      "score": 6,
      "title": "Underwhelming Story",
      "body": "While the gameplay is solid, I found the story of this game to be underwhelming and lacking depth.",
      "author": "StoryCritic",
      "date": "2022-08-09",
      "userId": 9
    },
    {
      "id": 19,
      "gameId": 8,
      "score": 8,
      "title": "Fantastic Multiplayer",
      "body": "This game shines in multiplayer mode! It offers thrilling matches and great teamwork opportunities.",
      "author": "MultiplayerGuru",
      "date": "2023-06-08",
      "userId": 1
    },
    {
      "id": 20,
      "gameId": 8,
      "score": 7,
      "title": "Good Single-player Campaign",
      "body": "The single-player campaign of this game is enjoyable and provides a solid story-driven experience.",
      "author": "SoloPlayer87",
      "date": "2023-04-23",
      "userId": 2
    },
    {
      "id": 21,
      "gameId": 8,
      "score": 9,
      "title": "Engaging Gameplay",
      "body": "The gameplay mechanics of this game are engaging and keep you invested for hours on end.",
      "author": "GameEnthusiast99",
      "date": "2022-11-11",
      "userId": 6
    },
    {
      "id": 22,
      "gameId": 9,
      "score": 9,
      "title": "Mind-Blowing Story",
      "body": "Prepare for a mind-blowing story in this game! The plot twists and character development are exceptional.",
      "author": "StoryDevotee",
      "date": "2023-01-28",
      "userId": 3
    },
    {
      "id": 23,
      "gameId": 9,
      "score": 8,
      "title": "Impressive Soundtrack",
      "body": "The soundtrack of this game is truly impressive, enhancing the immersive experience of the gameplay.",
      "author": "MusicLover123",
      "date": "2022-12-19",
      "userId": 10
    },
    {
      "id": 24,
      "gameId": 9,
      "score": 7,
      "title": "Solid Gameplay Mechanics",
      "body": "The gameplay mechanics of this game are solid and offer a satisfying combat and exploration experience.",
      "author": "GamerFanatic55",
      "date": "2022-08-31",
      "userId": 7
    },
    {
      "id": 25,
      "gameId": 9,
      "score": 6,
      "title": "Technical Issues",
      "body": "Unfortunately, this game suffers from technical issues that can hinder the overall enjoyment of the gameplay.",
      "author": "TechWoesGamer",
      "date": "2023-05-23",
      "userId": 8
    },
    {
      "id": 26,
      "gameId": 10,
      "score": 8,
      "title": "Addictive Multiplayer",
      "body": "The multiplayer mode of this game is incredibly addictive, providing endless fun and competition.",
      "author": "CompetitiveGamer88",
      "date": "2023-05-16",
      "userId": 9
    },
    {
      "id": 27,
      "gameId": 10,
      "score": 7,
      "title": "Enjoyable Co-op",
      "body": "Playing this game in co-op mode is enjoyable, but the single-player experience falls a bit short.",
      "author": "CoopPlayer123",
      "date": "2022-10-27",
      "userId": 4
    },
    {
      "id": 28,
      "gameId": 10,
      "score": 9,
      "title": "Immersive World",
      "body": "The game world is beautifully crafted, and the attention to detail creates an immersive experience.",
      "author": "WorldExplorer",
      "date": "2023-03-14",
      "userId": 5
    },
    {
      "id": 29,
      "gameId": 10,
      "score": 6,
      "title": "Unpolished Mechanics",
      "body": "While the game has potential, the mechanics feel unpolished and can be frustrating at times.",
      "author": "GameEnthusiast27",
      "date": "2023-01-07",
      "userId": 6
    },
    {
      "id": 31,
      "gameId": 1,
      "score": 5,
      "title": "TEST",
      "body": "TEST",
      "author": "ithompson92",
      "date": "2023-06-25",
      "userId": 2
    },
    {
      "gameId": 1,
      "score": 5,
      "title": "TEST",
      "body": "TEST",
      "author": "StoryLover87",
      "date": "2023-05-30",
      "userId": 1,
      "id": 32
    },
    {
      "gameId": 1,
      "score": 5,
      "title": "TEST",
      "body": "TEST",
      "author": "ithompson92",
      "date": "2023-06-13",
      "userId": 2,
      "id": 33
    },
    {
      "gameId": 1,
      "score": 5,
      "title": "TEST3s",
      "body": "TEST3",
      "author": "ithompson92",
      "date": "2023-06-13",
      "userId": 2,
      "id": 34
    },
    {
      "gameId": 1,
      "score": 5,
      "title": "TEST",
      "body": "TEST",
      "author": "ithompson92",
      "date": "2023-06-18",
      "userId": 2,
      "id": 35
    },
    {
      "gameId": 1,
      "score": 5,
      "title": "TEST23",
      "body": "TEST",
      "author": "Isabasdsa",
      "date": "2023-06-12",
      "userId": 2,
      "id": 36
    },
    {
      "gameId": 12,
      "score": 5,
      "title": "TEST",
      "body": "TEST",
      "author": "Isabella Thompson",
      "date": "2023-06-12",
      "userId": 2,
      "id": 37
    },
    {
      "gameId": 1,
      "score": "6",
      "title": "ASDAS",
      "body": "dsadsadsadsa",
      "author": "Jonathan Mitchell",
      "date": "2023-06-25 17:09",
      "userId": 1,
      "id": 38
    },
    {
      "gameId": 1,
      "score": "4",
      "title": "fortestTEST",
      "body": "fortestTEST",
      "author": "Christopher Turner TEST",
      "date": "2023-06-25 17:28",
      "userId": 3,
      "id": 39
    },
    {
      "gameId": 1,
      "score": 4,
      "title": "ssssss",
      "body": "test",
      "author": "Daniel Peterson",
      "date": "2023-06-25 17:29",
      "userId": 7,
      "id": 40
    },
    {
      "gameId": 1,
      "score": 3,
      "title": "asdasdsaSSSSSSSS5",
      "body": "test",
      "author": "Jonathan Mitchell",
      "date": "2023-06-25 17:54",
      "userId": 1,
      "id": 41
    },
    {
      "gameId": 1,
      "score": 4,
      "title": "TESTSSS",
      "body": "TEST",
      "author": "Christopher Turner",
      "date": "2023-06-25 18:07",
      "userId": 3,
      "id": 42
    },
    {
      "gameId": 1,
      "score": 0,
      "title": "",
      "body": "",
      "author": "Jonathan Mitchell",
      "date": "2023-06-25 18:26",
      "userId": 1,
      "id": 43
    },
    {
      "gameId": 1,
      "score": 5,
      "title": "TEST",
      "body": "TEST",
      "author": "",
      "date": "2023-06-25 18:30",
      "userId": 1,
      "id": 44
    }
  ],
  "users": [
    {
      "id": 1,
      "name": "Jonathan Mitchell",
      "username": "StoryLover87",
      "email": "jonathan.mitchell@example.com",
      "profile": "https://cdn.landesa.org/wp-content/uploads/default-user-image.png"
    },
    {
      "id": 2,
      "name": "Isabella Thompson",
      "username": "ithompson92",
      "email": "isabella.thompson@example.com",
      "profile": "https://cdn.landesa.org/wp-content/uploads/default-user-image.png"
    },
    {
      "id": 3,
      "name": "Christopher Turner",
      "username": "cturner19",
      "email": "christopher.turner@example.com",
      "profile": "https://cdn.landesa.org/wp-content/uploads/default-user-image.png"
    },
    {
      "id": 4,
      "name": "Olivia Reynolds",
      "username": "EnvironmentExplorer",
      "email": "olivia.reynolds@example.com",
      "profile": "https://cdn.landesa.org/wp-content/uploads/default-user-image.png"
    },
    {
      "id": 5,
      "name": "Matthew Jenkins",
      "username": "CompetitiveGamer88",
      "email": "matthew.jenkins@example.com",
      "profile": "https://cdn.landesa.org/wp-content/uploads/default-user-image.png"
    },
    {
      "id": 6,
      "name": "Sophia Hughes",
      "username": "shughes32",
      "email": "sophia.hughes@example.com",
      "profile": "https://cdn.landesa.org/wp-content/uploads/default-user-image.png"
    },
    {
      "id": 7,
      "name": "Daniel Peterson",
      "username": "dpeterson76",
      "email": "daniel.peterson@example.com",
      "profile": "https://cdn.landesa.org/wp-content/uploads/default-user-image.png"
    },
    {
      "id": 8,
      "name": "Liam Parker",
      "username": "lparker88",
      "email": "liam.parker@example.com",
      "profile": "https://cdn.landesa.org/wp-content/uploads/default-user-image.png"
    },
    {
      "id": 9,
      "name": "Emily Collins",
      "username": "VersatilePlayer42",
      "email": "emily.collins@example.com",
      "profile": "https://cdn.landesa.org/wp-content/uploads/default-user-image.png"
    },
    {
      "id": 10,
      "name": "James Wright",
      "username": "jwright71",
      "email": "james.wright@example.com",
      "profile": "https://cdn.landesa.org/wp-content/uploads/default-user-image.png"
    }
  ],
  "news": [
    {
      "id": 1,
      "title": "Upcoming DLC for Assassin's Creed Valhalla",
      "body": "Ubisoft has announced an upcoming DLC for Assassin's Creed Valhalla, the popular action-adventure game set in the Viking Age. The DLC, titled 'The Siege of Paris,' will take players on a thrilling journey to Francia, where they will encounter new enemies, explore new territories, and unravel a captivating story. With new quests, weapons, armor, and challenges, 'The Siege of Paris' promises to expand the epic Viking saga of Eivor. Fans of Assassin's Creed Valhalla can't wait to embark on this new adventure.",
      "author": "GamingNews123",
      "date": "2023-06-20",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 2,
      "title": "New Gameplay Trailer for Cyberpunk 2077",
      "body": "CD Projekt Red, the developer behind the highly anticipated game Cyberpunk 2077, has released a new gameplay trailer that showcases the game's stunning visuals, immersive open world, and intense action. Set in the dystopian Night City, players will assume the role of V, a mercenary outlaw with cybernetic enhancements, as they navigate a city filled with dangerous factions, advanced technology, and moral choices that shape the narrative. The new trailer gives a glimpse into the game's deep customization options, thrilling combat, and intriguing characters. Cyberpunk 2077 is poised to redefine the genre of open-world RPGs.",
      "author": "GameLover99",
      "date": "2023-06-18",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 3,
      "title": "Exclusive Interview with the Developers of FIFA 22",
      "body": "We had the opportunity to sit down with the developers of FIFA 22, the latest installment in the popular football simulation franchise. In the interview, the developers shared insights into the game's improved gameplay mechanics, enhanced graphics, and new features that will provide players with the most authentic football experience to date. From realistic player movements and improved AI to immersive stadium atmospheres and a revamped career mode, FIFA 22 aims to deliver an unparalleled football simulation. Fans of the series can look forward to an exciting and innovative game that captures the spirit of the beautiful game.",
      "author": "SportsGuru",
      "date": "2023-06-15",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 4,
      "title": "Announcement of New Characters in Super Smash Bros. Ultimate",
      "body": "Nintendo has recently announced the addition of new characters to Super Smash Bros. Ultimate, the beloved crossover fighting game featuring iconic video game characters. The upcoming DLC will introduce exciting new fighters, each with unique abilities and playstyles, expanding the already extensive roster. Fans can expect intense battles and thrilling matchups as they pit their favorite characters against each other in epic fights. With its fast-paced gameplay, stunning visuals, and a wealth of content, Super Smash Bros. Ultimate continues to be a must-play title for Nintendo and fighting game enthusiasts alike.",
      "author": "NintendoFanatic",
      "date": "2023-06-12",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 5,
      "title": "Review of Marvel's Spider-Man: Miles Morales",
      "body": "In our review of Marvel's Spider-Man: Miles Morales, the standalone expansion to the critically acclaimed Spider-Man game, we delve into the thrilling adventure of Miles Morales as he embraces his new role as Spider-Man. The game introduces players to a vibrant and detailed version of New York City, where they can swing through the streets, unleash spectacular combat moves, and face off against formidable villains. With its engaging storyline, breathtaking visuals, and tight gameplay mechanics, Marvel's Spider-Man: Miles Morales is a must-play for fans of the superhero genre and gaming enthusiasts alike.",
      "author": "SpideyFan",
      "date": "2023-06-10",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 6,
      "title": "Behind the Scenes of Call of Duty: Warzone",
      "body": "Take a behind-the-scenes look at the making of Call of Duty: Warzone, the popular battle royale game that has taken the gaming world by storm. The developers share insights into the game's development process, including the challenges faced and the innovative features that set Warzone apart from other battle royale titles. From the intense gunfights and tactical gameplay to the constantly evolving map and thrilling in-game events, Warzone offers a dynamic and adrenaline-pumping experience for players. Whether you're a fan of the franchise or a newcomer to the genre, Call of Duty: Warzone is sure to keep you hooked.",
      "author": "FPSMaster",
      "date": "2023-06-07",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 7,
      "title": "Review of The Legend of Zelda: Breath of the Wild 2",
      "body": "In our review of The Legend of Zelda: Breath of the Wild 2, the highly anticipated sequel to the critically acclaimed original, we delve into the expansive world of Hyrule once again. With new abilities, challenging puzzles, and a captivating storyline, Breath of the Wild 2 builds upon the success of its predecessor while introducing exciting new elements. Players will embark on a thrilling adventure as Link, exploring breathtaking landscapes, encountering powerful enemies, and uncovering the secrets of the ancient kingdom. With its stunning visuals, immersive gameplay, and innovative mechanics, The Legend of Zelda: Breath of the Wild 2 is a masterpiece that shouldn't be missed by any gaming enthusiast.",
      "author": "ZeldaFanatic",
      "date": "2023-06-05",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 8,
      "title": "Upcoming Expansion for World of Warcraft: Shadowlands",
      "body": "Blizzard Entertainment has announced an upcoming expansion for World of Warcraft: Shadowlands, the popular MMORPG. Titled 'Rise of the Void,' the expansion will introduce a new region, powerful enemies, and challenging dungeons for players to conquer. As tensions rise between the factions, the forces of the Void threaten to consume the realm, and players must rally their allies to face this new threat. With new quests, abilities, and gear, 'Rise of the Void' promises to bring fresh and exciting content to World of Warcraft players. Get ready to explore new realms and uncover the mysteries of the Void in this epic expansion.",
      "author": "WoWMaster",
      "date": "2023-06-03",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 9,
      "title": "Exclusive Preview of Halo Infinite Multiplayer",
      "body": "We were granted an exclusive preview of the highly anticipated multiplayer mode of Halo Infinite, the next installment in the iconic Halo franchise. The preview showcased the game's fast-paced combat, vast array of weapons, and exhilarating multiplayer maps. With its return to the series' roots and a focus on player freedom and creativity, Halo Infinite multiplayer aims to deliver an unforgettable experience for both new players and longtime fans. From intense team battles to thrilling objective-based modes, the multiplayer component of Halo Infinite is shaping up to be a true masterpiece that will keep players engaged for years to come.",
      "author": "HaloFan",
      "date": "2023-06-01",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 10,
      "title": "Release Date Announcement for Elder Scrolls VI",
      "body": "Bethesda Game Studios has finally announced the release date for Elder Scrolls VI, the highly anticipated next installment in the beloved RPG series. Fans have been eagerly awaiting this announcement, and the wait is finally over. The game is set to release on November 11, 2023, and promises to deliver an immersive open-world experience filled with rich storytelling, deep character customization, and epic quests. Whether you're a seasoned Elder Scrolls player or new to the franchise, Elder Scrolls VI is shaping up to be an unforgettable journey through a vast and stunning fantasy realm.",
      "author": "ESFanatic",
      "date": "2023-05-30",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 11,
      "title": "Interview with the Developers of Cyberpunk 2077",
      "body": "We had the opportunity to sit down with the developers of Cyberpunk 2077, the highly anticipated futuristic RPG. In the interview, the developers shared insights into the game's development process, the challenges faced, and the vision behind the immersive and gritty Night City. They discussed the intricate gameplay mechanics, the deep character progression system, and the branching narrative that offers players a multitude of choices and consequences. With its stunning visuals, compelling storyline, and immersive world, Cyberpunk 2077 aims to redefine the RPG genre and provide players with an unforgettable gaming experience.",
      "author": "CyberpunkEnthusiast",
      "date": "2023-05-28",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 12,
      "title": "Preview of FIFA 24's Career Mode",
      "body": "Get an exclusive preview of the highly anticipated Career Mode in FIFA 24, the latest installment of the popular football simulation game. The preview showcases the new features and improvements introduced in Career Mode, including enhanced player interactions, realistic transfer negotiations, and expanded managerial options. With its realistic gameplay, authentic presentation, and deep immersion into the world of professional football, FIFA 24's Career Mode aims to provide players with the ultimate football management experience. Whether you dream of leading a top club to glory or taking a small team to the pinnacle of success, FIFA 24's Career Mode offers something for every football fan.",
      "author": "FIFAExpert",
      "date": "2023-05-26",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 13,
      "title": "New Expansion Announcement for The Elder Scrolls Online",
      "body": "Bethesda Softworks has announced a new expansion for The Elder Scrolls Online, the popular MMORPG set in the vast world of Tamriel. Titled 'Rise of the Daedra,' the expansion takes players on an epic journey to confront the Daedric Princes and their minions. With new regions to explore, challenging quests to undertake, and powerful artifacts to obtain, 'Rise of the Daedra' promises to deliver a thrilling and immersive experience for both new and veteran players. Prepare to venture into the realms of Oblivion and face the forces of darkness in this exciting expansion for The Elder Scrolls Online.",
      "author": "ElderScrollsFanatic",
      "date": "2023-05-21",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 14,
      "title": "Review of Resident Evil Village: A Terrifying Experience",
      "body": "We dive into the latest installment in the acclaimed Resident Evil series with our review of Resident Evil Village. Set in a haunting village surrounded by dark secrets, players take on the role of Ethan Winters as he navigates treacherous environments and encounters grotesque creatures. With its stunning graphics, intense atmosphere, and visceral gameplay, Resident Evil Village delivers a terrifying experience that will keep players on the edge of their seats. Whether you're a fan of the franchise or a newcomer, this game is a must-play for horror enthusiasts looking for a spine-chilling adventure.",
      "author": "HorrorGamer88",
      "date": "2023-05-19",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 15,
      "title": "Preview of The Legend of Zelda: Breath of the Wild 2",
      "body": "Get a first look at the highly anticipated sequel to The Legend of Zelda: Breath of the Wild in our exclusive preview. Building upon the success of its predecessor, Breath of the Wild 2 introduces new mechanics, a vast and immersive world, and a captivating storyline. Players will embark on an adventure with Link, exploring stunning landscapes, solving intricate puzzles, and encountering formidable foes. With its beautiful art style, innovative gameplay, and attention to detail, The Legend of Zelda: Breath of the Wild 2 is shaping up to be another masterpiece in the beloved franchise.",
      "author": "ZeldaFanatic",
      "date": "2023-05-16",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 16,
      "title": "Interview with the Creators of God of War Ragnarok",
      "body": "We had the privilege of sitting down with the developers of the highly anticipated God of War Ragnarok, the next chapter in the epic God of War series. In the interview, the creators shared insights into the game's development, the challenges they faced, and the new features players can expect. They discussed the continuation of Kratos' journey, the Norse mythology setting, and the intense combat that has become a trademark of the franchise. With its stunning visuals, gripping narrative, and visceral gameplay, God of War Ragnarok aims to deliver an unforgettable experience for fans and newcomers alike.",
      "author": "MythologyEnthusiast",
      "date": "2023-05-14",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 17,
      "title": "New Update for Fortnite: Battle Royale",
      "body": "Epic Games has released a major update for Fortnite: Battle Royale, introducing exciting new features and gameplay enhancements. The update includes a new limited-time game mode, additional weapons and items, and improvements to the building mechanics. Players can also look forward to a fresh Battle Pass with exclusive cosmetic items to unlock. With its constant updates and engaging gameplay, Fortnite: Battle Royale continues to captivate millions of players worldwide, offering endless hours of fun and intense competition.",
      "author": "FortniteMaster",
      "date": "2023-05-11",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 18,
      "title": "Upcoming Esports Tournament: League of Legends Championship",
      "body": "Get ready for the biggest League of Legends tournament of the year as the Championship series returns with a new season of exhilarating esports action. The world's top teams will compete in intense battles, showcasing their skills and strategies on the Summoner's Rift. Fans can expect thrilling matches, jaw-dropping plays, and unforgettable moments as the teams fight for glory and a chance to be crowned the champions. Whether you're a dedicated fan or new to the world of esports, the League of Legends Championship is an event you won't want to miss.",
      "author": "EsportsFanatic",
      "date": "2023-05-09",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 19,
      "title": "Interview with the Director of Horizon Forbidden West",
      "body": "We had the opportunity to sit down with the director of the highly anticipated Horizon Forbidden West, the sequel to the critically acclaimed Horizon Zero Dawn. In the interview, the director discussed the expanded world of the game, the new challenges Aloy will face, and the innovative gameplay mechanics that will immerse players in a post-apocalyptic future. From breathtaking visuals to a captivating story, Horizon Forbidden West aims to push the boundaries of open-world gaming and deliver an unforgettable experience in a beautifully realized world.",
      "author": "GamingEnthusiast",
      "date": "2023-05-06",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 20,
      "title": "Announcement of New Map in Valorant: Operation Riptide",
      "body": "Riot Games has announced a new map for their popular tactical shooter, Valorant. Titled 'Operation Riptide,' the new map takes players to a remote tropical island filled with perilous challenges and strategic opportunities. With its unique design and interactive elements, 'Operation Riptide' aims to provide players with fresh gameplay experiences and exciting new strategies. Whether you're a seasoned veteran or new to the game, this new map promises to shake up the competitive landscape of Valorant and keep players engaged for hours on end.",
      "author": "ValorantPlayer",
      "date": "2023-05-04",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 21,
      "title": "Upcoming Indie Game Spotlight: Hollow Knight Silksong",
      "body": "Prepare to dive into the enchanting world of Hollow Knight once again with the highly anticipated sequel, Hollow Knight Silksong. In this upcoming indie game, players will take on the role of Hornet, a skilled warrior on a mission to unravel the mysteries of the kingdom of Pharloom. With its stunning hand-drawn visuals, challenging gameplay, and atmospheric soundtrack, Hollow Knight Silksong promises to captivate players with its unique charm and intricate world. Whether you're a fan of the original game or new to the series, this indie gem is definitely one to watch out for.",
      "author": "IndieGameLover",
      "date": "2023-05-01",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    },
    {
      "id": 22,
      "title": "Preview of Diablo IV: A Dark and Demonic Adventure",
      "body": "Get a sneak peek at the highly anticipated installment in the Diablo series with our preview of Diablo IV. Set in a dark and sinister world, the game offers a thrilling and immersive experience filled with demonic forces, challenging quests, and powerful loot. With its visceral combat, deep customization options, and cooperative multiplayer, Diablo IV aims to deliver an unforgettable action RPG experience. Whether you're a long-time fan of the franchise or new to the world of Diablo, this game is sure to satisfy your cravings for epic battles and devilish adventures.",
      "author": "RPGEnthusiast",
      "date": "2023-04-29",
      "thumbnail": "https://staticg.sportskeeda.com/editor/2022/01/2a502-16422609435716-1920.jpg"
    }
  ],
  "pictures": [
    {
      "gameId": 1,
      "url": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Wide_3840x2160-3840x2160-485fe17203671386c71bde8110886c7d.jpg"
    },
    {
      "gameId": 2,
      "url": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Wide_3840x2160-3840x2160-485fe17203671386c71bde8110886c7d.jpg"
    },
    {
      "gameId": 3,
      "url": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Wide_3840x2160-3840x2160-485fe17203671386c71bde8110886c7d.jpg"
    },
    {
      "gameId": 4,
      "url": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Wide_3840x2160-3840x2160-485fe17203671386c71bde8110886c7d.jpg"
    },
    {
      "gameId": 5,
      "url": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Wide_3840x2160-3840x2160-485fe17203671386c71bde8110886c7d.jpg"
    },
    {
      "gameId": 6,
      "url": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Wide_3840x2160-3840x2160-485fe17203671386c71bde8110886c7d.jpg"
    },
    {
      "gameId": 7,
      "url": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Wide_3840x2160-3840x2160-485fe17203671386c71bde8110886c7d.jpg"
    },
    {
      "gameId": 8,
      "url": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Wide_3840x2160-3840x2160-485fe17203671386c71bde8110886c7d.jpg"
    },
    {
      "gameId": 9,
      "url": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Wide_3840x2160-3840x2160-485fe17203671386c71bde8110886c7d.jpg"
    },
    {
      "gameId": 10,
      "url": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Wide_3840x2160-3840x2160-485fe17203671386c71bde8110886c7d.jpg"
    },
    {
      "gameId": 11,
      "url": "https://cdn1.epicgames.com/400347196e674de89c23cc2a7f2121db/offer/AC%20KINGDOM%20PREORDER_STANDARD%20EDITION_EPIC_Key_Art_Wide_3840x2160-3840x2160-485fe17203671386c71bde8110886c7d.jpg"
    },
    {
      "gameId": 11,
      "url": "https://howmanychapters.com/wp-content/uploads/2021/07/how-many-chapters-in-asasins-creed-valhalla.jpg"
    },
    {
      "gameId": 12,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 13,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 14,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 15,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 16,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 17,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 18,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 19,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 20,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 21,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 22,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 23,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 24,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 25,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 26,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 27,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 28,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 29,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    },
    {
      "gameId": 30,
      "url": "https://www.urbansplash.co.uk/images/placeholder-16-9.jpg"
    }
  ],
  "comments": [
    {
      "id": 1,
      "newsId": 1,
      "date": "2023-04-29",
      "userId": 1,
      "body": "Nullam et lectus eros. Suspendisse euismod, arcu sed vulputate feugiat, dolor lectus interdum purus, et ullamcorper tellus est in mauris. Vestibulum convallis nulla sit amet sapien interdum feugiat. Aliquam pretium, nisi ac finibus tristique, mauris arcu auctor turpis, ac efficitur eros sem id lectus."
    },
    {
      "id": 2,
      "newsId": 1,
      "date": "2023-04-29",
      "userId": 1,
      "body": "Nullam et lectus eros. Suspendisse euismod, arcu sed vulputate feugiat, dolor lectus interdum purus, et ullamcorper tellus est in mauris. Vestibulum convallis nulla sit amet sapien interdum feugiat. Aliquam pretium, nisi ac finibus tristique, mauris arcu auctor turpis, ac efficitur eros sem id lectus."
    },
    {
      "id": 3,
      "newsId": 1,
      "date": "2023-04-29",
      "userId": 1,
      "body": "Nullam et lectus eros. Suspendisse euismod, arcu sed vulputate feugiat, dolor lectus interdum purus, et ullamcorper tellus est in mauris. Vestibulum convallis nulla sit amet sapien interdum feugiat. Aliquam pretium, nisi ac finibus tristique, mauris arcu auctor turpis, ac efficitur eros sem id lectus."
    },
    {
      "id": 4,
      "newsId": 2,
      "userId": 2,
      "date": "2023-04-29",
      "body": "Nullam et lectus eros. Suspendisse euismod, arcu sed vulputate feugiat, dolor lectus interdum purus, et ullamcorper tellus est in mauris. Vestibulum convallis nulla sit amet sapien interdum feugiat. Aliquam pretium, nisi ac finibus tristique, mauris arcu auctor turpis, ac efficitur eros sem id lectus."
    },
    {
      "id": 10,
      "newsId": 2,
      "userId": 1,
      "date": "2023-04-29",
      "body": "Nullam et lectus eros. Suspendisse euismod, arcu sed vulputate feugiat, dolor lectus interdum purus, et ullamcorper tellus est in mauris. Vestibulum convallis nulla sit amet sapien interdum feugiat. Aliquam pretium, nisi ac finibus tristique, mauris arcu auctor turpis, ac efficitur eros sem id lectus."
    },
    {
      "id": 5,
      "newsId": 3,
      "userId": 3,
      "date": "2023-04-29",
      "body": "Nullam et lectus eros. Suspendisse euismod, arcu sed vulputate feugiat, dolor lectus interdum purus, et ullamcorper tellus est in mauris. Vestibulum convallis nulla sit amet sapien interdum feugiat. Aliquam pretium, nisi ac finibus tristique, mauris arcu auctor turpis, ac efficitur eros sem id lectus."
    },
    {
      "id": 6,
      "newsId": 4,
      "userId": 4,
      "date": "2023-04-29",
      "body": "Nullam et lectus eros. Suspendisse euismod, arcu sed vulputate feugiat, dolor lectus interdum purus, et ullamcorper tellus est in mauris. Vestibulum convallis nulla sit amet sapien interdum feugiat. Aliquam pretium, nisi ac finibus tristique, mauris arcu auctor turpis, ac efficitur eros sem id lectus."
    },
    {
      "newsId": 2,
      "userId": "",
      "body": "",
      "date": "",
      "id": 11
    },
    {
      "newsId": 2,
      "userId": "1",
      "body": "TESTTEST",
      "date": "2023-06-26 12:49",
      "id": 12
    },
    {
      "newsId": 2,
      "userId": 1,
      "body": "",
      "date": "2023-06-26 12:52",
      "id": 13
    },
    {
      "newsId": 2,
      "userId": 1,
      "body": "",
      "date": "2023-06-26 12:52",
      "id": 14
    },
    {
      "newsId": 2,
      "userId": 0,
      "body": "",
      "date": "",
      "id": 15
    },
    {
      "newsId": 2,
      "userId": 1,
      "body": "TEST",
      "date": "2023-06-26 12:53",
      "id": 16
    },
    {
      "newsId": 2,
      "userId": 1,
      "body": "TEST",
      "date": "2023-06-26 12:53",
      "id": 17
    },
    {
      "newsId": 2,
      "userId": 0,
      "body": "",
      "date": "",
      "id": 18
    },
    {
      "newsId": 2,
      "userId": 0,
      "body": "TEST",
      "date": "",
      "id": 19
    },
    {
      "newsId": 2,
      "userId": 2,
      "body": "TEST",
      "date": "2023-06-26 14:26",
      "id": 20
    },
    {
      "newsId": 2,
      "userId": 0,
      "body": "TEST",
      "date": "",
      "id": 21
    },
    {
      "newsId": 2,
      "userId": null,
      "body": "TEST",
      "date": "",
      "id": 22
    },
    {
      "newsId": 2,
      "userId": 1,
      "body": "test",
      "date": "2023-06-26 14:29",
      "id": 23
    },
    {
      "newsId": 2,
      "userId": null,
      "body": "test",
      "date": "",
      "id": 24
    },
    {
      "newsId": 2,
      "userId": null,
      "body": "TEST",
      "date": "",
      "id": 25
    },
    {
      "newsId": 2,
      "userId": 0,
      "body": "test",
      "date": "",
      "id": 26
    },
    {
      "newsId": 2,
      "userId": 1,
      "body": "TEST",
      "date": "",
      "id": 27
    },
    {
      "newsId": 2,
      "userId": 2,
      "body": "TEST",
      "date": "2023-06-26 14:35",
      "id": 28
    }
  ]
}